
tap 'caskroom/cask'

# Core Homebrew
brew 'acpica'
brew 'adns'
brew 'ansible'
brew 'arduino-cli'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bdw-gc'
brew 'bfg'
brew 'boost'
brew 'brew-gem'
brew 'cairo'
brew 'cmake'
brew 'direnv'
brew 'docbook'
brew 'docbook-xsl'
brew 'findutils'
brew 'fontconfig'
brew 'freetype'
brew 'fribidi'
brew 'fzf'
brew 'gd'
brew 'gdbm'
brew 'gem-jazzy'
brew 'gettext'
brew 'gh'
brew 'ghostscript'
brew 'gist'
brew 'git-flow-avh'
brew 'glib'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnupg'
brew 'gnutls'
brew 'gobject-introspection'
brew 'graphite2'
brew 'graphviz'
brew 'gts'
brew 'guile'
brew 'harfbuzz'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'icu4c'
brew 'ilmbase'
brew 'imagemagick'
brew 'jasper'
brew 'jp2a'
brew 'jpeg'
brew 'jq'
brew 'krb5'
brew 'libassuan'
brew 'libde265'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libheif'
brew 'libidn2'
brew 'libksba'
brew 'liblqr'
brew 'libomp'
brew 'libpng'
brew 'libressl'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvterm'
brew 'libxdg-basedir'
brew 'libyaml'
brew 'little-cms2'
brew 'lua'
brew 'luajit'
brew 'luarocks'
brew 'lzo'
brew 'msgpack'
brew 'ncurses'
brew 'neovim'
brew 'netpbm'
brew 'nettle'
brew 'node'
brew 'npth'
brew 'oniguruma'
brew 'openexr'
brew 'openjdk'
brew 'openjpeg'
brew 'openssl@1.1'
brew 'p11-kit'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'pinentry'
brew 'pinentry-mac'
brew 'pixman'
brew 'pkg-config'
brew 'postgresql'
brew 'pv'
brew 'python@3.8'
brew 'python@3.9'
brew 'readline'
brew 'ripgrep'
brew 'ruby'
brew 'shared-mime-info'
brew 'source-highlight'
brew 'sourcekitten'
brew 'sqlite'
brew 'swift-doc'
brew 'swift-sh'
brew 'swiftlint'
brew 'thefuck'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unbound'
brew 'unibilium'
brew 'utf8proc'
brew 'vapor'
brew 'webp'
brew 'wget'
brew 'x265'
brew 'xmlto'
brew 'xz'
brew 'yadm'

# Cask Apps
cask 'adobe-acrobat-reader'
cask 'adoptopenjdk'
cask 'alfred'
cask 'android-platform-tools'
cask 'android-studio'
cask 'arduino'
cask 'clipy'
cask 'deluge'
cask 'discord'
cask 'firefox'
cask 'font-inconsolatago-nerd-font'
cask 'font-iosevka'
cask 'fork'
cask 'fritzing'
cask 'ghidra'
cask 'gitify'
cask 'google-chrome'
cask 'insomnia'
cask 'iterm2'
cask 'karabiner-elements'
cask 'linear-linear'
cask 'microsoft-office'
cask 'multipass'
cask 'ngrok'
cask 'openvpn-connect'
cask 'plex-media-player'
cask 'raspberry-pi-imager'
cask 'spotify'
cask 'synergy'
cask 'tableplus'
cask 'telegram'
cask 'textmate'
cask 'transmission'
cask 'vagrant'
cask 'vagrant-manager'
cask 'vimr'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'wkhtmltopdf'
cask 'xquartz'

