tap "adityagarg8/git-credential-email"
tap "charmbracelet/tap"
tap "goreleaser/tap"

# ── CLI tools ─────────────────────────────────────────────────────────────────

brew "age"
brew "ansible"
brew "aria2"
brew "awscli"
brew "bat"
brew "cmake"
brew "direnv"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fortune"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "go-task"
brew "graphviz"
brew "gum"
brew "htop"
brew "hub"
brew "imagemagick"
brew "jq"
brew "mas"
brew "mods"
brew "neovim"
brew "pinentry-mac"
brew "protobuf"
brew "ripgrep"
brew "gsed"
brew "svu"
brew "tailscale"
brew "tmux"
brew "tz"
brew "wget"
brew "zoxide"
brew "zsh"
brew "adityagarg8/git-credential-email/git-credential-gmail"

# ── Dev tools ─────────────────────────────────────────────────────────────────

brew "actionlint"
brew "clang-tools-extra"
brew "delve"
brew "gofumpt"
brew "golangci-lint"
brew "hadolint"
brew "node"
brew "prettier"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "rustup"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "templ"
brew "terraform"
brew "tflint"
brew "yarn"

# ── Casks ─────────────────────────────────────────────────────────────────────

cask "1password"
cask "alacritty"
cask "alt-tab"
cask "caffeine"
cask "clipy"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "kitty"
cask "linear-linear"
cask "microsoft-remote-desktop"
cask "multitouch"
cask "openlens"
cask "raycast"
cask "rectangle"
cask "rio"
cask "slack"
cask "spotify"
cask "tailscale-app"
cask "telegram-desktop"
cask "the-unarchiver"
cask "vmware-fusion"
cask "visual-studio-code"
cask "wezterm@nightly"
cask "whatsapp"
cask "xquartz"
cask "goreleaser/tap/goreleaser-pro"

# ── Fonts ─────────────────────────────────────────────────────────────────────

cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"
cask "font-inconsolata-lgc-nerd-font"

# ── Mac App Store ─────────────────────────────────────────────────────────────

mas "AdBlock Pro", id: 1018301773
mas "LanguageTool", id: 1534275760
mas "Vimari", id: 1480933946
mas "Xcode", id: 497799835
